egilll/zephyr-gd32/drivers/usb/udc/udc_dwc2_vendor_quirks.h
static inline int gd32_usb_wait_irc48m_stable(void)
{
#if DT_NODE_EXISTS(DT_NODELABEL(rcu))
	mem_addr_t addctl_reg = (mem_addr_t)(DT_REG_ADDR(DT_NODELABEL(rcu)) + GD32_ADDCTL_OFFSET);
	k_timepoint_t timeout;

	/* If IRC48M is not enabled, there is nothing to wait for. */
	if ((sys_read32(addctl_reg) & GD32_RCU_ADDCTL_IRC48MEN) == 0U) {
		return 0;
	}

	timeout = sys_timepoint_calc(K_MSEC(10));
	while ((sys_read32(addctl_reg) & GD32_RCU_ADDCTL_IRC48MSTB) == 0U) {
		if (sys_timepoint_expired(timeout)) {
			return -ETIMEDOUT;
		}

		k_usleep(50);
	}
#endif

	return 0;
}

#if defined(CONFIG_SOC_SERIES_GD32F4XX)
static inline int gd32f4xx_wait_flag(rcu_flag_enum flag, FlagStatus target, uint32_t timeout_ms)
{
	k_timepoint_t timeout = sys_timepoint_calc(K_MSEC(timeout_ms));

	while (rcu_flag_get(flag) != target) {
		if (sys_timepoint_expired(timeout)) {
			return -ETIMEDOUT;
		}

		k_usleep(50);
	}

	return 0;
}

static inline int gd32f4xx_usbfs_configure_ck48m_from_pllsai(void)
{
	uint32_t pllm = RCU_PLL & RCU_PLL_PLLPSC;
	uint32_t input_rate_hz;
	uint32_t pllsai_n;
	int ret;

	if (pllm == 0U) {
		return -EINVAL;
	}

	if ((RCU_PLL & RCU_PLL_PLLSEL) == RCU_PLLSRC_HXTAL) {
		rcu_osci_on(RCU_HXTAL);
		ret = gd32f4xx_wait_flag(RCU_FLAG_HXTALSTB, SET, 100);
		if (ret < 0) {
			return ret;
		}

		input_rate_hz = HXTAL_VALUE / pllm;
	} else {
		ret = gd32f4xx_wait_flag(RCU_FLAG_IRC16MSTB, SET, 100);
		if (ret < 0) {
			return ret;
		}

		input_rate_hz = IRC16M_VALUE / pllm;
	}

	if ((input_rate_hz == 0U) || ((288000000U % input_rate_hz) != 0U)) {
		return -EINVAL;
	}

	pllsai_n = 288000000U / input_rate_hz;
	if ((pllsai_n < RCU_PLLSAIN_MUL_MIN) || (pllsai_n > RCU_PLLSAIN_MUL_MAX)) {
		return -EINVAL;
	}

	rcu_osci_off(RCU_PLLSAI_CK);
	(void)gd32f4xx_wait_flag(RCU_FLAG_PLLSAISTB, RESET, 10);

	if (rcu_pllsai_config(pllsai_n, 6U, 2U) != SUCCESS) {
		return -EINVAL;
	}

	rcu_osci_on(RCU_PLLSAI_CK);
	ret = gd32f4xx_wait_flag(RCU_FLAG_PLLSAISTB, SET, 100);
	if (ret < 0) {
		return ret;
	}

	rcu_pll48m_clock_config(RCU_PLL48MSRC_PLLSAIP);
	rcu_ck48m_clock_config(RCU_CK48MSRC_PLL48M);

	return 0;
}
#endif

static inline int gd32_usb_enable_embedded_phy(const struct device *dev, bool vbus_sensing)
{
	const struct udc_dwc2_config *const config = dev->config;
	mem_addr_t gccfg_reg = (mem_addr_t)&config->base->ggpio;
	mem_addr_t gusbcfg_reg = (mem_addr_t)&config->base->gusbcfg;
	uint32_t gccfg_bits = USB_DWC2_GCCFG_GD32_PWRON |
			      USB_DWC2_GCCFG_GD32_VBUSACEN |
			      USB_DWC2_GCCFG_GD32_VBUSBCEN;
	uint32_t gusbcfg;

	/*
	 * Reference: GD32_28_USBFS.md and GD32_29_USBHS.md document USBx_GCCFG
	 * fields (PWRON/VBUSACEN/VBUSBCEN/VBUSIG) and that VBUSIG can be set to
	 * ignore VBUS in device mode.
	 */
	if (!vbus_sensing) {
		gccfg_bits |= USB_DWC2_GCCFG_GD32_VBUSIG;
	}

	sys_set_bits(gccfg_reg, gccfg_bits);

	/*
	 * The GD32 vendor USBFS device driver programs the embedded-FS PHY
	 * turnaround time to 5. Leaving it at reset value 0 causes reset and
	 * speed detection to work, but control traffic never becomes valid.
	 */
	gusbcfg = sys_read32(gusbcfg_reg);
	gusbcfg &= ~USB_DWC2_GUSBCFG_GD32_UTT_MASK;
	gusbcfg |= USB_DWC2_GUSBCFG_GD32_UTT_FS;
	sys_write32(gusbcfg, gusbcfg_reg);

	/* Vendor reference uses ~20ms delay after transceiver power-on. */
	k_msleep(20);

	return 0;
}

static inline int gd32_usb_disable_embedded_phy(const struct device *dev)
{
	const struct udc_dwc2_config *const config = dev->config;
	mem_addr_t gccfg_reg = (mem_addr_t)&config->base->ggpio;

	sys_clear_bits(gccfg_reg, USB_DWC2_GCCFG_GD32_PWRON);

	return 0;
}

static inline int gd32_usbhs_init_caps(const struct device *dev)
{
	struct udc_data *data = dev->data;

	data->caps.hs = true;

	return 0;
}

/*
 * TODO EGILL!
 * GD32 USBFS appears to assert IN endpoint "NAK effective" (INEPNAKEFF) as a
 * level condition that can lead to an interrupt storm when masked/enabled like
 * other DWC2 integrations do. Mask it out and clear any latched INEPNAKEFF
 * flags after ISR handling.
 */
static inline int gd32_dwc2_irq_clear(const struct device *dev)
{
	const struct udc_dwc2_config *const config = dev->config;
	struct usb_dwc2_reg *const base = config->base;
	mem_addr_t diepmsk_reg = (mem_addr_t)&base->diepmsk;

	sys_clear_bits(diepmsk_reg, USB_DWC2_DIEPINT_INEPNAKEFF);

	/* Clear any latched INEPNAKEFF for all configured IN endpoints. */
	for (size_t i = 0; i < config->num_in_eps; i++) {
		sys_write32(USB_DWC2_DIEPINT_INEPNAKEFF,
			    (mem_addr_t)&base->in_ep[i].diepint);
	}

	return 0;
}

#define _GD32_DWC2_CLK_ON(node_id, prop, idx)					\
	do {									\
		uint16_t clk_id = DT_CLOCKS_CELL_BY_IDX(node_id, idx, id);	\
		ret = clock_control_on(GD32_CLOCK_CONTROLLER,			\
				       (clock_control_subsys_t)&clk_id);	\
		if (ret) {							\
			return ret;						\
		}								\
	} while (0);

#define QUIRK_GD32_USBFS_DEFINE(n)						\
	static const struct reset_dt_spec reset_##n =				\
		RESET_DT_SPEC_INST_GET_OR(n, {0});				\
										\
	static int gd32_usbfs_pre_enable_##n(const struct device *dev)		\
	{									\
		const struct udc_dwc2_config *const config = dev->config;	\
		int ret;							\
										\
		/* Enable all clocks listed in devicetree. */			\
		DT_INST_FOREACH_PROP_ELEM(n, clocks,				\
			_GD32_DWC2_CLK_ON)					\
										\
		ret = gd32_usb_wait_irc48m_stable();				\
		if (ret) {							\
			return ret;						\
		}								\
										\
		if (reset_##n.dev != NULL && device_is_ready(reset_##n.dev)) {	\
			ret = reset_line_toggle_dt(&reset_##n);			\
			if (ret && ret != -ENOSYS) {				\
				return ret;					\
			}							\
		}								\
										\
		/* GD32F4 USBFS examples drive CK48M from PLL48M/PLLSAIP. */	\
		IF_ENABLED(CONFIG_SOC_SERIES_GD32F4XX, (			\
			ret = gd32f4xx_usbfs_configure_ck48m_from_pllsai();	\
			if (ret) {						\
				return ret;					\
			}							\
		))								\
										\
		/* Ensure PHY clock is not gated. */				\
		sys_write32(0, (mem_addr_t)&config->base->pcgcctl);		\
		return 0;							\
	}									\
										\
	static int gd32_usbfs_post_enable_##n(const struct device *dev)		\
	{									\
		return gd32_usb_enable_embedded_phy(dev,				\
						    DT_INST_PROP(n, vbus_sensing));\
	}									\
										\
	const struct dwc2_vendor_quirks dwc2_vendor_quirks_##n = {		\
		.pre_enable = gd32_usbfs_pre_enable_##n,			\
		.post_enable = gd32_usbfs_post_enable_##n,			\
		.disable = gd32_usb_disable_embedded_phy,			\
		.irq_clear = gd32_dwc2_irq_clear,					\
	};

#define QUIRK_GD32_USBHS_DEFINE(n)						\
	static const struct reset_dt_spec reset_##n =				\
		RESET_DT_SPEC_INST_GET_OR(n, {0});				\
										\
	static int gd32_usbhs_pre_enable_##n(const struct device *dev)		\
	{									\
		const struct udc_dwc2_config *const config = dev->config;	\
		int ret;							\
										\
		/* Enable all clocks listed in devicetree. */			\
		DT_INST_FOREACH_PROP_ELEM(n, clocks,				\
			_GD32_DWC2_CLK_ON)					\
										\
		if (reset_##n.dev != NULL && device_is_ready(reset_##n.dev)) {	\
			ret = reset_line_toggle_dt(&reset_##n);			\
			if (ret && ret != -ENOSYS) {				\
				return ret;					\
			}							\
		}								\
										\
		/* Ensure PHY clock is not gated. */				\
		sys_write32(0, (mem_addr_t)&config->base->pcgcctl);		\
		return 0;							\
	}									\
										\
	static int gd32_usbhs_post_enable_##n(const struct device *dev)		\
	{									\
		bool ulpi = (DT_INST_NUM_CLOCKS(n) > 1) &&			\
			    (DT_INST_CLOCKS_CELL_BY_IDX(n, 1, id) == GD32_CLOCK_USBHSULPI);\
										\
		if (ulpi) {							\
			return 0;						\
		}								\
										\
		return gd32_usb_enable_embedded_phy(dev,				\
						    DT_INST_PROP(n, vbus_sensing));\
	}									\
										\
	const struct dwc2_vendor_quirks dwc2_vendor_quirks_##n = {		\
		.pre_enable = gd32_usbhs_pre_enable_##n,			\
		.post_enable = gd32_usbhs_post_enable_##n,			\
		.caps = gd32_usbhs_init_caps,					\
		.irq_clear = gd32_dwc2_irq_clear,					\
	};

#define QUIRK_GD32_DWC2_DEFINE(n)						\
	COND_CODE_1(DT_INST_NODE_HAS_COMPAT(n, gd_gd32_usbfs),			\
		    (QUIRK_GD32_USBFS_DEFINE(n)),				\
		    (COND_CODE_1(DT_INST_NODE_HAS_COMPAT(n, gd_gd32_usbhs),	\
				 (QUIRK_GD32_USBHS_DEFINE(n)), ())))

DT_INST_FOREACH_STATUS_OKAY(QUIRK_GD32_DWC2_DEFINE)

#endif /* DT_HAS_COMPAT_STATUS_OKAY(gd_gd32_usbfs) || DT_HAS_COMPAT_STATUS_OKAY(gd_gd32_usbhs) */

/* Add next vendor quirks definition above this line */

#endif /* ZEPHYR_DRIVERS_USB_UDC_DWC2_VENDOR_QUIRKS_H */
